{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-FIRST_NAME",
    "1": "I-HOUSE",
    "2": "U-FIRST_NAME",
    "3": "L-FIRST_NAME",
    "4": "B-CITY",
    "5": "B-STREET",
    "6": "L-DISTRICT",
    "7": "U-REGION",
    "8": "I-REGION",
    "9": "U-LAST_NAME",
    "10": "I-STREET",
    "11": "U-CITY",
    "12": "L-CITY",
    "13": "U-HOUSE",
    "14": "U-COUNTRY",
    "15": "B-COUNTRY",
    "16": "B-HOUSE",
    "17": "L-MIDDLE_NAME",
    "18": "L-COUNTRY",
    "19": "B-MIDDLE_NAME",
    "20": "B-DISTRICT",
    "21": "U-MIDDLE_NAME",
    "22": "O",
    "23": "B-REGION",
    "24": "U-STREET",
    "25": "L-HOUSE",
    "26": "U-DISTRICT",
    "27": "L-STREET",
    "28": "I-CITY",
    "29": "L-REGION",
    "30": "L-LAST_NAME",
    "31": "I-COUNTRY",
    "32": "I-LAST_NAME",
    "33": "B-LAST_NAME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CITY": 4,
    "B-COUNTRY": 15,
    "B-DISTRICT": 20,
    "B-FIRST_NAME": 0,
    "B-HOUSE": 16,
    "B-LAST_NAME": 33,
    "B-MIDDLE_NAME": 19,
    "B-REGION": 23,
    "B-STREET": 5,
    "I-CITY": 28,
    "I-COUNTRY": 31,
    "I-HOUSE": 1,
    "I-LAST_NAME": 32,
    "I-REGION": 8,
    "I-STREET": 10,
    "L-CITY": 12,
    "L-COUNTRY": 18,
    "L-DISTRICT": 6,
    "L-FIRST_NAME": 3,
    "L-HOUSE": 25,
    "L-LAST_NAME": 30,
    "L-MIDDLE_NAME": 17,
    "L-REGION": 29,
    "L-STREET": 27,
    "O": 22,
    "U-CITY": 11,
    "U-COUNTRY": 14,
    "U-DISTRICT": 26,
    "U-FIRST_NAME": 2,
    "U-HOUSE": 13,
    "U-LAST_NAME": 9,
    "U-MIDDLE_NAME": 21,
    "U-REGION": 7,
    "U-STREET": 24
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
